{
  "header": {
    "about": "About",
    "projects": "Projects",
    "contact": "Contact"
  },
  "presentation": {
    "badge": "Available for new projects",
    "name": "Adams J. Contreras",
    "role": "Full Stack Developer",
    "description": "Full Stack Developer with over 7 years of experience building scalable, high-performance web and mobile solutions.",
    "viewWork": "View Work",
    "contactMe": "Contact Me",
    "badgeDev": "Dev",
    "badgeCreative": "Creative",
    "fullName": "Adams J. Contreras R.",
    "modalRole": "Full Stack Developer"
  },
  "about": {
    "title": "About Me",
    "intro": "I'm Adams J. Contreras, a Venezuelan developer with over 7 years of experience in web technologies.",
    "experience": "My expertise spans both backend and frontend development, as well as mobile applications. I've worked as a Team Lead managing multicultural teams, always focused on results, delivery timelines, and code optimization.",
    "passion": "I'm passionate about creating efficient and scalable technology solutions, prioritizing best practices and the quality of the final product.",
    "nationality": "Nationality",
    "nationalityValue": "Venezuelan",
    "experienceLabel": "Experience",
    "experienceValue": "+7 years",
    "roles": "Roles",
    "rolesValue": "Full Stack Developer, Team Lead, Mobile Developer"
  },
  "skills": {
    "title": "Technical Skills",
    "description": "Comprehensive expertise across modern web technologies, mobile development, and cloud infrastructure",
    "frontend": "Frontend",
    "backend": "Backend",
    "mobile": "Mobile",
    "database": "Database",
    "devops": "DevOps & Cloud",
    "tools": "Tools & Others"
  },
  "projects": {
    "title": "Featured Projects",
    "description": "Enterprise-level applications and production-ready solutions showcasing full-stack expertise, scalable architecture, and industry best practices",
    "items": {
      "simustream": {
        "title": "SimuStream - Video Platform Backend",
        "description": "Production-grade video streaming platform with MongoDB, Express, Socket.io, Stripe payments, AWS S3 storage, player analytics, email notifications, referral system, and cron-based automation. Complete enterprise solution."
      },
      "nextjs-strapi": {
        "title": "Next.js 16 + Strapi CMS",
        "description": "Full-stack application with Next.js 16 and Strapi 5, featuring JWT authentication, dynamic content management, protected routes, and server-side caching. Built with modern App Router architecture."
      },
      "shopify-integration": {
        "title": "Shopify Integration API",
        "description": "Backend middleware connecting Shopify and Simustream platforms. Features automated webhook synchronization for products, OAuth authentication, Stripe integration, and HTTPS with SSL certificates."
      },
      "video-player-monorepo": {
        "title": "Video Player Monorepo",
        "description": "Modular monorepo with multiple video player implementations using different architectures. Includes webpack-based player, shared component library, and lightweight jQuery player for various deployment scenarios."
      },
      "fastapi-supabase": {
        "title": "FastAPI + Supabase REST API",
        "description": "Modern REST API with MVC architecture and 79% test coverage. Features complete CRUD operations, Pydantic validation, auto-generated Swagger docs, and PostgreSQL backend with Supabase."
      },
      "angular-enterprise": {
        "title": "Angular Enterprise Architecture",
        "description": "Scalable Angular 16 application demonstrating modular architecture with lazy loading, strict TypeScript configuration, comprehensive testing setup with Jasmine/Karma, and production-ready optimization."
      },
      "mcp-ai-email": {
        "title": "MCP AI Email Integration",
        "description": "Model Context Protocol tool that bridges AI systems with email functionality, enabling intelligent email automation based on business logic. Built with TypeScript for seamless AI integration."
      },
      "eslint-config": {
        "title": "ESLint Config Package",
        "description": "Enterprise-grade ESLint configuration package published to npm for Strut Software and Rithm Software projects. Features modular configs for JavaScript, TypeScript, Angular, RxJS with composable inheritance."
      },
      "php-rest-api": {
        "title": "PHP REST API with MySQL",
        "description": "Professional REST API built with PHP 8 following MVC pattern. Features HTTP request logging, multilingual error handling, standardized JSON responses, and database-driven configuration."
      },
      "ils-travel-insurance": {
        "title": "ILS Travel Insurance Mobile App",
        "description": "Master mobile application for travel insurance management built with Ionic 6 and Angular 10. Features multi-client access, unified quoting system, real-time price calculations, SMS/email notifications, and multi-language support (ES/EN/PT). Production APK with native Cordova plugins."
      },
      "travelkit-insurance": {
        "title": "TravelKit Insurance Mobile App",
        "description": "Cross-platform travel insurance application with Ionic and Angular. Integrates Authorize.net and PayPal payment gateways, features dynamic quote generation, payment form processing, and native mobile components. Includes internationalization and SMS notifications."
      },
      "voyager-insurance": {
        "title": "Voyager Insurance Mobile App",
        "description": "Mobile insurance quotation platform with advanced statistical dashboards and analytics. Built with Ionic 6 and Angular 10, featuring real-time calculations, email notifications, payment processing, and comprehensive reporting tools for travel insurance management."
      }
    }
  },
  "contact": {
    "title": "Let's Work Together",
    "description": "I'm currently open to new opportunities and exciting projects. Let's connect and build something amazing!",
    "highlight1Title": "7+ Years",
    "highlight1Description": "of proven experience in full-stack development",
    "highlight2Title": "Team Leadership",
    "highlight2Description": "with multicultural teams across time zones",
    "highlight3Title": "Results-driven",
    "highlight3Description": "approach with focus on delivery and optimization",
    "highlight4Title": "Full-stack expertise",
    "highlight4Description": "in modern web and mobile technologies",
    "contactInformation": "Contact Information",
    "email": "Email",
    "whatsapp": "WhatsApp",
    "github": "GitHub",
    "linkedin": "LinkedIn",
    "sendEmail": "Send me an email",
    "connectLinkedIn": "Connect on LinkedIn"
  }
}
